Hashi/NomadConsul/cloudlab/results/30-05-24/12/socialNetwork/5/nomad-sn-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-client-t8-c512-d30-R500-N5
Using argument nginx
using  args: threads=8 and connections=512 and duration=30 and requests=500
Running 30s test @ http://10.10.1.4:8080
  8 threads and 512 connections
  Thread calibration: mean lat.: 1.222ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.247ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.214ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.173ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.249ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.189ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.235ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.169ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     1.18ms  302.99us   1.91ms   67.54%
    Req/Sec    64.95     83.62   333.00     87.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.14ms
 75.000%    1.38ms
 90.000%    1.60ms
 99.000%    1.91ms
 99.900%    2.20ms
 99.990%    2.69ms
 99.999%    2.73ms
100.000%    2.73ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.483     0.000000            1         1.00
       0.810     0.100000          990         1.11
       0.913     0.200000         1983         1.25
       0.988     0.300000         2972         1.43
       1.060     0.400000         3946         1.67
       1.142     0.500000         4942         2.00
       1.184     0.550000         5428         2.22
       1.228     0.600000         5924         2.50
       1.274     0.650000         6413         2.86
       1.329     0.700000         6911         3.33
       1.382     0.750000         7402         4.00
       1.413     0.775000         7654         4.44
       1.444     0.800000         7896         5.00
       1.474     0.825000         8138         5.71
       1.513     0.850000         8387         6.67
       1.554     0.875000         8635         8.00
       1.580     0.887500         8759         8.89
       1.604     0.900000         8878        10.00
       1.630     0.912500         9002        11.43
       1.659     0.925000         9125        13.33
       1.694     0.937500         9248        16.00
       1.708     0.943750         9310        17.78
       1.730     0.950000         9375        20.00
       1.748     0.956250         9433        22.86
       1.768     0.962500         9497        26.67
       1.789     0.968750         9557        32.00
       1.801     0.971875         9587        35.56
       1.814     0.975000         9619        40.00
       1.830     0.978125         9649        45.71
       1.846     0.981250         9680        53.33
       1.860     0.984375         9709        64.00
       1.876     0.985938         9725        71.11
       1.895     0.987500         9741        80.00
       1.904     0.989062         9758        91.43
       1.928     0.990625         9772       106.67
       1.943     0.992188         9786       128.00
       1.952     0.992969         9794       142.22
       1.974     0.993750         9802       160.00
       1.987     0.994531         9810       182.86
       1.996     0.995313         9819       213.33
       2.007     0.996094         9825       256.00
       2.020     0.996484         9830       284.44
       2.024     0.996875         9833       320.00
       2.037     0.997266         9837       365.71
       2.053     0.997656         9841       426.67
       2.083     0.998047         9844       512.00
       2.091     0.998242         9846       568.89
       2.105     0.998437         9848       640.00
       2.135     0.998633         9850       731.43
       2.195     0.998828         9852       853.33
       2.213     0.999023         9854      1024.00
       2.277     0.999121         9855      1137.78
       2.283     0.999219         9856      1280.00
       2.291     0.999316         9857      1462.86
       2.293     0.999414         9858      1706.67
       2.377     0.999512         9859      2048.00
       2.377     0.999561         9859      2275.56
       2.571     0.999609         9860      2560.00
       2.571     0.999658         9860      2925.71
       2.683     0.999707         9861      3413.33
       2.683     0.999756         9861      4096.00
       2.683     0.999780         9861      4551.11
       2.695     0.999805         9862      5120.00
       2.695     0.999829         9862      5851.43
       2.695     0.999854         9862      6826.67
       2.695     0.999878         9862      8192.00
       2.695     0.999890         9862      9102.22
       2.731     0.999902         9863     10240.00
       2.731     1.000000         9863          inf
#[Mean    =        1.178, StdDeviation   =        0.303]
#[Max     =        2.730, Total count    =         9863]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14719 requests in 30.06s, 2.79MB read
  Socket errors: connect 0, read 0, write 0, timeout 1059
Requests/sec:    489.57
Transfer/sec:     95.14KB